; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v10 ?v12)
             (pred_3 ?v5 ?v1)
             (pred_6 ?v10 ?v1)
             (pred_11 ?v8 ?v10 )
	     (pred_9 ?v10)
             (pred_1 ?v11)
             (pred_7 ?v5)
             (pred_2 ?v1)
             (pred_10 ?v10)
             (pred_4 ?v5)
             (pred_8 ?v10)
             (pred_5 ))



(:action op_3
:parameters (?v4 ?v6 ?v7 ?v13)
:precondition (and (pred_1 ?v4) (pred_1 ?v6) (pred_7 ?v7) (pred_2 ?v13)
          (pred_12 ?v4 ?v6) (pred_3 ?v7 ?v13)
                   (pred_6 ?v6 ?v13) (pred_9 ?v4) 
                   (pred_10 ?v6) (pred_4 ?v7))
:effect (and  (pred_8 ?v6) (not (pred_10 ?v6))))


(:action op_5
:parameters (?v4 ?v3)
:precondition (and (pred_1 ?v4) (pred_1 ?v3)
               (pred_9 ?v4) (pred_12 ?v4 ?v3) (pred_8 ?v3))
:effect (and (pred_9 ?v3) (not (pred_9 ?v4))))

(:action op_4
:parameters (?v4 ?v7)
:precondition (and (pred_1 ?v4) (pred_7 ?v7) 
                  (pred_9 ?v4) (pred_11 ?v7 ?v4) (pred_5 ))
:effect (and (pred_4 ?v7)
   (not (pred_11 ?v7 ?v4)) (not (pred_5 ))))


(:action op_2
:parameters (?v4 ?v9 ?v2)
:precondition (and (pred_1 ?v4) (pred_7 ?v9) (pred_7 ?v2)
                  (pred_9 ?v4) (pred_4 ?v2) (pred_11 ?v9 ?v4))
:effect (and (pred_4 ?v9) (pred_11 ?v2 ?v4)
        (not (pred_4 ?v2)) (not (pred_11 ?v9 ?v4))))

(:action op_1
:parameters (?v4 ?v7)
:precondition (and (pred_1 ?v4) (pred_7 ?v7) 
                  (pred_9 ?v4) (pred_4 ?v7))
:effect (and (pred_5 ) (pred_11 ?v7 ?v4) (not (pred_4 ?v7)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_13 obj_01 obj_11 obj_05 obj_06 obj_02 obj_03 obj_07
    obj_08 obj_04
    obj_12 obj_09
    )

    (:init
       (pred_5)

       (pred_1 obj_10)
       (pred_1 obj_13)
       (pred_1 obj_01)
       (pred_1 obj_11)
       (pred_1 obj_05)
       (pred_1 obj_06)
       (pred_1 obj_02)
       (pred_1 obj_03)
       (pred_1 obj_07)
       (pred_2 obj_08)
       (pred_2 obj_04)
       (pred_7 obj_12)
       (pred_7 obj_09)

       (pred_12 obj_10 obj_11)
       (pred_12 obj_10 obj_13)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_13 obj_01)
       (pred_12 obj_13 obj_10)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_13)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_11 obj_05)
       (pred_12 obj_11 obj_10)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_05 obj_06)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_05 obj_11)
       (pred_12 obj_06 obj_07)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_06 obj_05)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_07 obj_06)
       (pred_12 obj_07 obj_03)
       (pred_10 obj_06)
       (pred_10 obj_01)
       (pred_6  obj_06 obj_08)
       (pred_6  obj_01 obj_04)
       (pred_8 obj_10)
       (pred_8 obj_13)
       (pred_8 obj_11)
       (pred_8 obj_05)
       (pred_8 obj_02)
       (pred_8 obj_03)
       (pred_8 obj_07)

       (pred_3  obj_12 obj_08)
       (pred_3  obj_09 obj_04)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_09 obj_03)
       (pred_9 obj_07)
    )

    (:goal (and
       (pred_11 obj_09 obj_10)
    ))
(:constraints
  (always (not (pred_9 obj_05)))
)
)

; plan
1. (op_5 obj_07 obj_03)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_03)
   goals met: 0 of 1
2. (op_4 obj_03 obj_09)
   deleted: (pred_11 obj_09 obj_03) (pred_5)
   added: (pred_4 obj_09)
   goals met: 0 of 1
3. (op_5 obj_03 obj_02)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_02)
   goals met: 0 of 1
4. (op_5 obj_02 obj_11)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_11)
   goals met: 0 of 1
5. (op_5 obj_11 obj_10)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_10)
   goals met: 0 of 1
6. (op_1 obj_10 obj_09)
   deleted: (pred_4 obj_09)
   added: (pred_5) (pred_11 obj_09 obj_10)
   goals met: 1 of 1
